tutorials/cases/posterDemo-woodStart/0.orig/Ts
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ts;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

// Cold by default; the bed (lower 5 layers) is set to 800 K by setFields. The
// hot inlet holds the bed base at 800 K so the Ts-driven shrinkage is
// sustained from below.
internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 800;
    }
    outlet
    {
        type            zeroGradient;
    }
    sideWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
