tutorials/cases/posterDemo-woodStart/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2.5D vertical slab for the poster DEM-coupling demo. One cell thick in y
// (the front/back faces are `empty`, OpenFOAM's standard 2D treatment), so the
// run solves in the x-z plane while the YADE spheres occupy two y-layers
// (y = 0.005 m and y = 0.013 m) with 1 mm wall clearance at each y-face.
// Gravity acts along -z; hot gas enters the bottom (inlet) and leaves the top
// (outlet). Kept deliberately small (48 cells) so the coupled YADE+OpenFOAM
// run finishes quickly.

scale 1;

// Cross-section 0.04 x 0.018 m (1 cell thick in y), height 0.24 m.
// y-width = 0.018 m gives two sphere layers (d=8 mm) with 1 mm wall clearance.
xMin  0;
xMax  0.04;
yMin  0;
yMax  0.018;
zMin  0;
zMax  0.24;

vertices
(
    (0    0     0   )   // 0
    (0.04 0     0   )   // 1
    (0.04 0.018 0   )   // 2
    (0    0.018 0   )   // 3
    (0    0     0.096)  // 4
    (0.04 0     0.096)  // 5
    (0.04 0.018 0.096)  // 6
    (0    0.018 0.096)  // 7
);

// 4 x 1 cells across, 12 cells tall -> 48 cells.
// dx = 0.01 m, dy = 0.018 m, dz = 0.008 m.
blocks
(
    hex (0 1 2 3 4 5 6 7) (4 1 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sideWalls
    {
        type wall;
        faces
        (
            (1 2 6 5)   // x = xMax
            (3 0 4 7)   // x = xMin
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)   // y = yMin
            (2 3 7 6)   // y = yMax
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
