tutorials/cases/posterDemo-woodStart/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2 ranks, split along the column height (z). YADE spawns these 2 OF ranks
// via MPI_Comm_spawn (numProcOF = 2 in MPI_lambda.py).

numberOfSubdomains 2;

method            simple;

simpleCoeffs
{
    n               (1 1 2);
    delta           0.001;
}

// ************************************************************************* //
